

# COMMANDS

moderator_commands = [
    "```&ban <member> <time> <reason>``` - банит пользователя"
    "```&unban <member-id>``` - разбанивает пользователя",
    "```&kick <member> <reason>``` - кикает пользователя",
    "```&mute <member> <time> <reason>``` - мутит пользователя",
    "```&unmute <member> <time> <reason>``` - размучивает пользователя"]

economy_commands = [
    "```&shoprl``` - магазин ролей",
    "```&addrole <role>``` - добавляет роль в магазин (Разрешено только администрации)"
    "```&removerole <role>``` - удаляет роль из магазина (Разрешено только администрации)"
    "```&buy <role>``` - купить роль из магазина"
    "```&ld``` - топ по балансу"
]

dgshop_commands = [
    "```&buydg``` - покупка",
    "```&shopdg``` - цены",
    "```&dgina <text>``` - все что хочешь добавить в аватарку",
    "```&dginp <text>``` - все что хочешь добавить в превью",
    "```&dginl <text>``` - все что хочешь добавить в лого",
    "```&dginyt <text>``` - все что хочешь добавить в ютубпак",
    "```&dginpp <text>``` - все что хочешь добавить в превьюпак",
    "```&dginfp <text>``` - все что хочешь добавить в fullpack"
]


general_commands = [
    "🤍Фанни команды \n Развекательние команды, например зделать приятно пользователю, заняться с ним любовью и в том духе.",
    "💙Модер команды \n Основыне модератор команды, бан, кик, мут. Также есть команды на создание роли или активирование авто модерации (Новая функция дискорда)",
    "💛Экономика \n Основние команды экономики, также есть магазин и ролей, и предметов (Экономика будет полностю построена пользователями дискорд сервера)",
    "🤑DG-shop \n Да, Вы не ожидали рекламы в боте но... Это наш магазин! И да, тут есть его команды. В нашём магазине вы найдёте автарки, шапки даже превью для ютуба.",
]

funny_commands = [
    "```&fight <member>``` - побить пользователя"
    "```&kiss <member>``` - поцеловать пользователя"
    "```&seks <member>``` - заняться интимом з пользователем (Только попробуй з мужиком... И после 18 лет, либо...)"
    "```&minet <member>``` - зделать минет пользователю (Только попробуй мужику...)"
    "```&menurp``` - рп-меню по командам"
]

help_commands = [
    "```&moderator-help``` - настройка модерации",
    "```&economy-help``` - настройка экономики",
    "```&rp-help``` - настройка рп-системы",
    "```&prefix-help``` - настройка префикса"
]

# GIF

fight_gif = [
    "https://c.tenor.com/i2nUVSB5op4AAAAC/punch-%D1%83%D0%B4%D0%B0%D1%80.gif",
    "https://vgif.ru/gifs/136/vgif-ru-14077.gif",
    "https://i.gifer.com/RVH.gif",
    "https://c.tenor.com/3sdp-ebY5IIAAAAC/bogatyr-three-bogatyrs.gif"
]

kiss_gif = [
    "https://acegif.com/wp-content/uploads/anime-kiss-m.gif",
    "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQceRJJA-Ra_oF6Mn9rKvZd3KiwQCE6k-BiPVWqyZVypaOr-WD4OzhdNO482Af-fGnccRA&usqp=CAU",
    "https://lifeo.ru/wp-content/uploads/anime-gif-kiss-4.gif"
    "https://i.gifer.com/C3GK.gif"
]

seks_gif = [
    "https://i.gifer.com/origin/12/1273569cb46c83a4234fdb48b30e6edd.gif",
    "https://i.gifer.com/Qw02.gif",
    "https://i.gifer.com/origin/14/142de7d3a231360c55ad2862015666b1_w200.webp"
]

minet_gif = [
    "",
    "",
    ""
]


